app/controllers/messages_controller.rb

    def auth
        @message = Message.find(params[:id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def create
        @message = Message.new(message_params)
        if !@message.password_digest
            @message.password_digest = "no-password"
        end
   	    if @message.save
---
INSERT INTO "messages" ("created_at", "updated_at", "body", "email", "token") VALUES (?, ?, ?, ?, ?)  [["created_at", "2017-10-01 22:18:22.194392"], ["updated_at", "2017-10-01 22:18:22.194392"], ["body", "testing"], ["email", "coltonchilders@gmail.com"], ["token", "224485bf7221781d61ca"]]

    def show
        @message = Message.find(params[:id])

        if @message.password_digest != "no-password"
            redirect_to '/messages/' + @message.id.to_s + '/' + @message.token + '/auth'
        else
            @message.destroy
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 6]]

    def update
        @message = Message.find(params[:id])
        if password_param[:pw] != nil
            @res = @message.authenticate(password_param[:pw])
            if @res
                @message.password_digest = "no-password"
                @message.save
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
UPDATE "messages" SET "password_digest" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["password_digest", "no-password"], ["updated_at", "2017-10-02 03:32:07.278739"], ["id", 30]]